documents/FunctionInference.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-03-10 Sun 18:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Function Inference</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Michael Lynch" />
</head>
<body>
<div id="content">
<h1 class="title">Function Inference</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8642a5f">1. Motivation</a>
<ul>
<li><a href="#org02ce82b">1.1. Usage Example</a>
<ul>
<li><a href="#org4584b08">1.1.1. Function Inference Example</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org964979a">2. Algorithm for Function Inference</a>
<ul>
<li><a href="#org93ce1ac">2.1. Formal Definition of Function Inference Algorithm</a>
<ul>
<li><a href="#orge901c54">2.1.1. Function Definitions Used Within Algorithm Formula</a></li>
<li><a href="#org6fd2740">2.1.2. Algorithm Formula</a></li>
</ul>
</li>
<li><a href="#org2e6368a">2.2. Example Inferences</a>
<ul>
<li><a href="#orgfb96285">2.2.1. Context Deduction</a></li>
<li><a href="#org337087f">2.2.2. A slightly less simple program</a></li>
<li><a href="#org3249938">2.2.3. Horizontal Inference</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org8642a5f" class="outline-2">
<h2 id="org8642a5f"><span class="section-number-2">1</span> Motivation</h2>
<div class="outline-text-2" id="text-1">
<p>
Function inference allows for a function to have multiple overloads for the 
same parameters types, but return values of different types depending on the context in which the 
function was used.
Function inference forms an integral part of NoSyn's extention framework, allowing the user of the language
to create a DSL or general purpose language within NoSyn with great capability to customize it's syntax.
</p>
</div>

<div id="outline-container-org02ce82b" class="outline-3">
<h3 id="org02ce82b"><span class="section-number-3">1.1</span> Usage Example</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Consider the following expression:
</p>
<div class="org-src-container">
<pre class="src src-c++">2:6
</pre>
</div>

<p>
The user may with wish this to mean concatenating the two numbers into a list of integers.
But there are also languages in which this symbol is used to denote to the start and the end of an 
array slice:
</p>
<div class="org-src-container">
<pre class="src src-go">//GO CODE
a[2:6]
</pre>
</div>

<p>
NoSyn provides the user with the ability to overload all operators, infact by default no operators are defined.
Assuming that an overload function has been created for the square brackets on an array to perform array access,
the user could set up the language as follows:
</p>
<div class="org-src-container">
<pre class="src src-c++">//NO SYN code
[T] operator_:_&lt;T&gt;(T a, T b) {
  native_formArray(a,b)
}
[T] operator_:_&lt;T&gt;(T x, [T] xs) {
  native_formArray(x,xs)
}

T operator_[]_&lt;T&gt;([T] array, Int index) {
  native_indexAccess(array, index)
}
[T] operator_[]_&lt;T&gt;([T] array, [Int] index) {
  native_sliceArray(array, index)
}

//Assuming 'a' is an Integer array.
[Int] slicedArray = a[2:6] 
</pre>
</div>

<p>
This system will work providing the user with the capability to use the colon symbol as both an array contatentation operator
as well as an array slice operator.
But this way comes with a serious flaw:
</p>
<div class="org-src-container">
<pre class="src src-c++">[Int] slicedArray = a[2:4:5:6]
</pre>
</div>

<p>
This should be considered a syntax error. But it's not. 
As the operator overload for [] is expecting to see an 
array, <code>2:4:5:6</code> is a perfectly plausible expression to put inside the square brackets.
Of course the error could be picked up in the <code>native_sliceArray</code> expression but this would mean that 
the check would only be made at runtime.
This is where function inference can become very useful.
</p>
</div>

<div id="outline-container-org4584b08" class="outline-4">
<h4 id="org4584b08"><span class="section-number-4">1.1.1</span> Function Inference Example</h4>
<div class="outline-text-4" id="text-1-1-1">
<div class="org-src-container">
<pre class="src src-c++">//NO SYN code
[T] operator_:_&lt;T&gt;(T a, T b) {
  native_formArray(a,b)
}
(Int, Int) operator_:_(Int l, Int r) {
  (l,r)
}
[T] operator_:_&lt;T&gt;(T x, [T] xs) {
  native_formArray(x,xs)
}

T operator_[]_&lt;T&gt;([T] array, Int index) {
  native_indexAccess(array, index)
}
[T] operator_[]_&lt;T&gt;([T] array,  (Int, Int) arraySlicer) {
  native_sliceArray(array, index)
}

//Assuming 'a' is an Integer array.
[Int] slicedArray = a[2:6] 
</pre>
</div>

<p>
This new implementation allows for both element concatenation and array slicing while maintaining the ability to throw an
error at compile time when <code>a[1:2:3]</code> is provided.
This code still has a problem however. The operator overload that has been created returns a tuple of two ints.
This is not ideal as the syntax that was specifically designed for generating an array slice would also be used in other contexts:
</p>
<div class="org-src-container">
<pre class="src src-c++">//Unwanted ability to create regular tuples
(Int, Int) vector = 20:30 
//Unwanted ability to use tuples within the array access
[Int] slicedArray = a[(2,6)] 
</pre>
</div>

<p>
In order to prevent this usage of the colon operator, a closed alias can be used:
</p>
<div class="org-src-container">
<pre class="src src-c++">alias closed ArraySlicer = (Int, Int)

ArraySlicer operator_:_(Int a, Int b) {
  (l,r)
}

operator_[]_&lt;T&gt;([T] array, ArraySlicer arraySlicer)_{
  native_sliceArray(array, arraySlicer)
}
</pre>
</div>

<p>
Using this implementation. The colon operator overload function will only be infered if the context in which it is used is specifically 
of the type <code>ArraySlicer</code> and not simply <code>(Int, Int)</code>.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org964979a" class="outline-2">
<h2 id="org964979a"><span class="section-number-2">2</span> Algorithm for Function Inference</h2>
<div class="outline-text-2" id="text-2">
<p>
Function inference uses a type inference algorithm to work out which function overload to use. Where as type inference is often used to save the programmer time by
not requiring the user to specify what the type of a variable or function is, function inference expects a certain amount of information about the context it is being
used in. As such, <b>NoSyn</b> does not allow the user to specify a variable without also specifying the type of that variable. Functions similarly must indicate what the return type
is, although template types are still valid.
This constraint employed in using function inference is used to reduce the ambiguity which can arise using such a type system. Later I will explore ways in which type inference of variables
may be possible alongside function inference, and why such a feature may not be wanted.
</p>
</div>

<div id="outline-container-org93ce1ac" class="outline-3">
<h3 id="org93ce1ac"><span class="section-number-3">2.1</span> Formal Definition of Function Inference Algorithm</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orge901c54" class="outline-4">
<h4 id="orge901c54"><span class="section-number-4">2.1.1</span> Function Definitions Used Within Algorithm Formula</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
\(\Omega(r,p)[y'] \Rightarrow k\)
</p>

<ul class="org-ul">
<li>Where \(r\) is the set of all possible return types for a function call to function identifier \(y'\)</li>
<li>Where \(p\) is the list of sets of possible parameter types for a function call to function identifier \(y'\)</li>
<li>Where \(k\) is the set of all possible function overloads given \(r\) and  \(p\) for a function call to identifier \(y'\)</li>
</ul>

<p>
\(\Theta z \Rightarrow n\)
</p>

<ul class="org-ul">
<li>Where \(z\) is a set of possible function overloads</li>
<li>\(n\) is the list of sets of all possible return types for the parameters of function calls from the given overloads</li>
</ul>

<p>
\(\Phi x \Rightarrow m\)
</p>

<ul class="org-ul">
<li>where \(z\) is a set of possible function overloads</li>
<li>\(m\) is the set of all possible return types for those function overloads</li>
</ul>

<p>
\(y^\dagger\)
</p>

<ul class="org-ul">
<li>where \(y\) is a function call</li>
<li>\(y^\dagger\) is a list of parameter expressions for the function call \(y\). 
All parameters can be assumed to be function calls as literals can be expressed as function calls to functions with single overloads and no parameters</li>
</ul>

<p>
\(y'\)
</p>
<ul class="org-ul">
<li>where \(y\) is a function call</li>
<li>\(y'\) is the identifier for that function call (\(y\) = <code>foo(bar())</code> &rArr; \(y'\) = <code>foo</code>)</li>
</ul>

<p>
\(\ast\) is the wildcard operator. When applying this to an intersection \(\ast \cap \alpha\) the result is always \(\alpha\)
</p>

<p>
\(\cap\) intersection applies recursively within a data structure.
</p>
<ul class="org-ul">
<li>The intersection of two lists is the intersection of its elements</li>
<li>The intersection of two tuples is the intersection of its elements</li>
<li>The intersection of two sets is equivalent to a standard intersection</li>
</ul>
</div>
</div>
