documents/FunctionInference.org
*** Algorithm Formula
$\Lambda(r, p)[y] \Rightarrow k$
- where $y$ is a function call
- where $r$ is the set of all possible return types for function call $y$
- where $p$ is the list of sets of all possible return types for the parameters of $y$
- $k$ is the set of all possible function overloads for function call $y$


The algorithm for function inference can be written as:

$\Lambda x[y] :=$

$\textit{let } p := [\forall (\alpha, \beta).\Theta \Lambda (\alpha, \ast) [\beta]| \textit{zip}(\Theta \Omega x[y'], y^\dagger)] \textit{ in }$

$\Lambda(\Phi \Omega(x \cap (\ast, p))[y'], p)[y]$

 The function $\Lambda x[y]$ calls recursively until $\Omega(x,p)[y']$ reduces to only a single possible function overload.
 If $\Omega(x,p)[y']$ never reduces to a single function overload, the function call is ambigiuous and a compile error should occur.
** Example Inferences
*** Context Deduction
 Function inference works on the basis of deducing the context in which a function is being used. 
 All function calls are expressions and can be built up into larger expressions.
 + All expressions have a single type
 + Expressions can be used as a statement if they have the type =Nothing=
 + literals have a clear concrete type

 Using these rules we can deduce that given the following statement:
 #+BEGIN_SRC c++
 foo(10)
 #+END_SRC
 + The type of the expression =foo(10)= must be =Nothing= as it is being used as a statement
 + The function overload of =foo= is =Int->Nothing= as the literal =10= has the concrete type of =Int=

 As the /NoSyn/ language, unlike similar languages like /C/, allows for functions with the same name and parameter types to have multiple different 
 return types, expressions already raise an issue of ambiguity. /C/ and /Java/ would in this situation go for the function overload for =foo= which took a single integer as a parameter and then
 ignore the return type. This is not possible in /NoSyn/ due to the potential for there to be multiple overloads with the same parameter types causing ambiguity.
 Instead there is a special datatype which a function can return if the programmer wants to use a call to the function at the statement level. This is the =Nothing= datatype, which as it's name
 suggests, does not return anything. An expression of the type =Nothing= is never a subexpression of another expression as =Nothing=. This is because =Nothing= does not have any value and as such cannot
 be passed into any other function. With this knowledge, we always know that the base type of any expression within the language is of type =Nothing=, and all subexpressions in that expression are 
 of some non =Nothing= type.

*** A slightly less simple program
 #+BEGIN_SRC c++
 //foo_IntNothing
 Nothing foo(Int a) {..} 
 //foo_IntInt
 Int foo(Int a) {..} 
 //bar_Int
 Int bar() {..} 
 //bar_Float
 Float bar() {..} 

 foo(foo(bar())) //Expression A
 #+END_SRC
 Expression A is an example of where function inference is required to find the correct function to be used. If you take the subexpressions of expression /A/ out of context, the functions they 
 refer to cannot be known:
 - =bar()= may refer to =bar_Int= or =bar_Float=
 - =foo(bar())= may refer to =foo_IntNothing= or =foo_IntInt=
  
 In order to deduce the type of each subexpression, we must work from the information that we know concretely.
 The base expression =foo(foo(bar())= must return =Nothing= as it is being used as statement. From this we can gather all the function overloads for foo which return =Nothing=. In this 
 simple program there is only one function which this could be, =foo_IntNothing=. Given this information, we can now deduce that the subexpression =foo(bar())= must be of type =Int= if
 it is to satisfy the base expression. Again, as a simple program, there is in this case only one function which =foo= could be refering to: =foo_IntInt=.
 This then gives us the knowledge to work out what our final subexpression refers to. There is one function overload for =bar= which returns an =Int= which is 
 =bar_Int=. This completes the deduction of all functions in the expression giving us:
 #+BEGIN_SRC c++
   foo_IntNothing(foo_IntInt(bar_Int()))
 #+END_SRC

*** Horizontal Inference
 With the previous example, the correct function overloads could be infered by working in a top down fashion from the parent expression =foo(foo(bar()))= down to the leaf subexpression =bar()=.
 This can be refered to as vertical inference in the sense that by looking at the context of an expression or it's subexpressions it is possible to infer the type of the expression.
 
Horizontal Inference means that the type of a subexpression on the same level as the current one has an effect on the type which this subexpression could be. Such inference is achieved by 
 working up and down the expression tree gradually eliminating the possible types of expressions until all are resolved down to a single type.
 #+BEGIN_SRC c++
 Nothing foo(Int a, Double a) {..} //foo_IntDoubleNothing
 Nothing foo(Int a, Char a) {..} //foo_IntCharNothing
 Nothing foo(Double, Int a) {..} //foo_DoubleIntNothing
 Int bar() {..} //bar_Int
 Char bar() {..} //bar_Char
 Int cello() {..} //cello_Int
 Double cello() {..} //cello_Double

 foo(bar(), cello()) //Expression B
 #+END_SRC

