documents/FunctionInference.html

<div id="outline-container-org6fd2740" class="outline-4">
<h4 id="org6fd2740"><span class="section-number-4">2.1.2</span> Algorithm Formula</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
\(\Lambda(r, p)[y] \Rightarrow k\)
</p>
<ul class="org-ul">
<li>where \(y\) is a function call</li>
<li>where \(r\) is the set of all possible return types for function call \(y\)</li>
<li>where \(p\) is the list of sets of all possible return types for the parameters of \(y\)</li>
<li>\(k\) is the set of all possible function overloads for function call \(y\)</li>
</ul>


<p>
The algorithm for function inference can be written as:
</p>

<p>
\(\Lambda x[y] :=\)
</p>

<p>
\(\textit{let } p := [\forall (\alpha, \beta).\Theta \Lambda (\alpha, \ast) [\beta]| \textit{zip}(\Theta \Omega x[y'], y^\dagger)] \textit{ in }\)
</p>

<p>
\(\Lambda(\Phi \Omega(x \cap (\ast, p))[y'], p)[y]\)
</p>

<p>
The function \(\Lambda x[y]\) calls recursively until \(\Omega(x,p)[y']\) reduces to only a single possible function overload.
If \(\Omega(x,p)[y']\) never reduces to a single function overload, the function call is ambigiuous and a compile error should occur.
</p>
</div>
</div>
</div>
<div id="outline-container-org2e6368a" class="outline-3">
<h3 id="org2e6368a"><span class="section-number-3">2.2</span> Example Inferences</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-orgfb96285" class="outline-4">
<h4 id="orgfb96285"><span class="section-number-4">2.2.1</span> Context Deduction</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
Function inference works on the basis of deducing the context in which a function is being used. 
All function calls are expressions and can be built up into larger expressions.
</p>
<ul class="org-ul">
<li>All expressions have a single type</li>
<li>Expressions can be used as a statement if they have the type <code>Nothing</code></li>
<li>literals have a clear concrete type</li>
</ul>

<p>
Using these rules we can deduce that given the following statement:
</p>
<div class="org-src-container">
<pre class="src src-c++">foo(10)
</pre>
</div>
<ul class="org-ul">
<li>The type of the expression <code>foo(10)</code> must be <code>Nothing</code> as it is being used as a statement</li>
<li>The function overload of <code>foo</code> is <code>Int-&gt;Nothing</code> as the literal <code>10</code> has the concrete type of <code>Int</code></li>
</ul>

<p>
As the <i>NoSyn</i> language, unlike similar languages like <i>C</i>, allows for functions with the same name and parameter types to have multiple different 
return types, expressions already raise an issue of ambiguity. <i>C</i> and <i>Java</i> would in this situation go for the function overload for <code>foo</code> which took a single integer as a parameter and then
ignore the return type. This is not possible in <i>NoSyn</i> due to the potential for there to be multiple overloads with the same parameter types causing ambiguity.
Instead there is a special datatype which a function can return if the programmer wants to use a call to the function at the statement level. This is the <code>Nothing</code> datatype, which as it's name
suggests, does not return anything. An expression of the type <code>Nothing</code> is never a subexpression of another expression as <code>Nothing</code>. This is because <code>Nothing</code> does not have any value and as such cannot
be passed into any other function. With this knowledge, we always know that the base type of any expression within the language is of type <code>Nothing</code>, and all subexpressions in that expression are 
of some non <code>Nothing</code> type.
</p>
</div>
</div>

<div id="outline-container-org337087f" class="outline-4">
<h4 id="org337087f"><span class="section-number-4">2.2.2</span> A slightly less simple program</h4>
<div class="outline-text-4" id="text-2-2-2">
<div class="org-src-container">
<pre class="src src-c++">//foo_IntNothing
Nothing foo(Int a) {..} 
//foo_IntInt
Int foo(Int a) {..} 
//bar_Int
Int bar() {..} 
//bar_Float
Float bar() {..} 

foo(foo(bar())) //Expression A
</pre>
</div>
<p>
Expression A is an example of where function inference is required to find the correct function to be used. If you take the subexpressions of expression <i>A</i> out of context, the functions they 
refer to cannot be known:
</p>
<ul class="org-ul">
<li><code>bar()</code> may refer to <code>bar_Int</code> or <code>bar_Float</code></li>
<li><code>foo(bar())</code> may refer to <code>foo_IntNothing</code> or <code>foo_IntInt</code></li>
</ul>

<p>
In order to deduce the type of each subexpression, we must work from the information that we know concretely.
The base expression <code>foo(foo(bar())</code> must return <code>Nothing</code> as it is being used as statement. From this we can gather all the function overloads for foo which return <code>Nothing</code>. In this 
simple program there is only one function which this could be, <code>foo_IntNothing</code>. Given this information, we can now deduce that the subexpression <code>foo(bar())</code> must be of type <code>Int</code> if
it is to satisfy the base expression. Again, as a simple program, there is in this case only one function which <code>foo</code> could be refering to: <code>foo_IntInt</code>.
This then gives us the knowledge to work out what our final subexpression refers to. There is one function overload for <code>bar</code> which returns an <code>Int</code> which is 
<code>bar_Int</code>. This completes the deduction of all functions in the expression giving us:
</p>
<div class="org-src-container">
<pre class="src src-c++">foo_IntNothing(foo_IntInt(bar_Int()))
</pre>
</div>
</div>
</div>

<div id="outline-container-org3249938" class="outline-4">
<h4 id="org3249938"><span class="section-number-4">2.2.3</span> Horizontal Inference</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
With the previous example, the correct function overloads could be infered by working in a top down fashion from the parent expression <code>foo(foo(bar()))</code> down to the leaf subexpression <code>bar()</code>.
This can be refered to as vertical inference in the sense that by looking at the context of an expression or it's subexpressions it is possible to infer the type of the expression.
</p>

<p>
Horizontal Inference means that the type of a subexpression on the same level as the current one has an effect on the type which this subexpression could be. Such inference is achieved by 
 working up and down the expression tree gradually eliminating the possible types of expressions until all are resolved down to a single type.
</p>
<div class="org-src-container">
<pre class="src src-c++">Nothing foo(Int a, Double a) {..} //foo_IntDoubleNothing
Nothing foo(Int a, Char a) {..} //foo_IntCharNothing
Nothing foo(Double, Int a) {..} //foo_DoubleIntNothing
Int bar() {..} //bar_Int
Char bar() {..} //bar_Char
Int cello() {..} //cello_Int
Double cello() {..} //cello_Double

foo(bar(), cello()) //Expression B
</pre>
</div>
</div>

<ol class="org-ol">
