documents/FunctionInference.org
**** Applying the Function Inference Algorithm to Expression B
As expression B is being used as a statement, the function inference begins with the known return type =Nothing= and unknown parameter types.
This gives the \lambda function: 

- $\Lambda(\{Nothing\}.\ast)[foo(bar(),cello())]$

  - $p := [\forall (\alpha,\beta).\Theta \Lambda (\alpha, \ast) [\beta] | \textit{zip}(\Theta \Omega (\{Nothing\}.\ast)[foo], [bar(),cello()]])]$
    - $\Omega (\{Nothing\}.\ast)[foo] = \{ foo\_IntDoubleNothing, foo\_IntCharNothing, foo\_DoubleIntNothing \}$

    - $\Theta \{ foo\_IntDoubleNothing, foo\_IntCharNothing, foo\_DoubleIntNothing \} = [\{Int, Double\}, \{Int, Double, Char\}]$

    - $\textit{zip}([\{Int, Double\}, \{Int, Double, Char\}], [bar(), cello()]) = [(\{Int, Double\}, bar()), (\{Int, Double, Char\}, cello())$

    - $p = [\Theta \Lambda(\{Int, Double\}, \ast)[bar()], \Theta \Lambda(\{Int, Double, Char\}, \ast)[cello()]]$

      - $\Lambda(\{Int, Double\}, \ast)[bar()]$

        - $p := []$
          
        - $\Omega (\{Int, Double\}, [])[bar] = \{bar\_Int\}$

          *RESOLVES*

        - $\Rightarrow \Lambda (\{Int, Double\}, \ast)[bar()] = \{bar\_Int\} = \{bar\_Int\}$

      - $\Lambda(\{Int, Double, Char\}, \ast)[cello()]$

        - $p := []$

        - $\Lambda(\Phi \Omega (\{Int, Double, Char\}, [])[cello], [])[cello()]$

          - $\Omega (\{Int, Double, Char\}, [])[cello] = \{cello\_Int, cello\_Double\}$

          - $\Phi \{cello\_Int, cello\_Double\}$

          - $\Lambda(\{Int, Double\}, [])[cello()]$

            - $p := []$

            - $\Omega(\{Int, Double\}, [])[cello] = \{cello\_Int, cello\_Double\}$

              *CYCLIC*

            - $\Rightarrow \Lambda(\{Int, Double\}, [])[cello()] = \{cello\_Int, cello\_Double\}$

        - $\Rightarrow \Lambda(\{Int, Double, Char\}, \ast)[cello()] = \{cello\_Int, cello\_Double\}$

      - $p = [\Theta \{bar\_Int\}, \Theta \{cello\_Int, cello\_Double]$

      - $p = [\{Int\}, \{Int, Double\}]$

  - $\Lambda(\Phi \Omega(\{Nothing\}, [\{Int\}, \{Int, Double\}])[foo], [\{Int\}, \{Int, Double\}])[foo(bar(),cello())]$

    - $\Phi \Omega(\{Nothing\}, [\{Int\}, \{Int, Double\}])[foo] = \{Nothing\}$

    - $\Lambda(\{Nothing\}, [\{Int\}, \{Int, Double\}])[foo(bar(),cello())]$

      - $\Omega(\{Nothing\}, [\{Int\}, \{Int, Double\}])[foo] = \{foo\_IntDoubleNothing\}$

        *RESOLVES*

      - $\Rightarrow \Lambda(\Phi \Omega(\{Nothing\}, [\{Int\}, \{Int, Double\}])[foo], [\{Int\}, \{Int, Double\}])[foo(bar(),cello())] = \{foo\_IntDoubleNothing\}$

  - $\Rightarrow \Lambda(\{Nothing\}, \ast)[foo(bar(),cello())] = \{foo\_IntDoubleNothing\}$


***** Explaination

   As with before, each expression within expression /B/ cannot on its own have it's function infered. 
   Again as before, as the main expression /B/ is being used as a statement,
   the type can be infered to be =Nothing=. As such, the set of possible =foo= functions expression /B/ could refer to is:

   $\Omega (\{Nothing\}.\ast)[foo] = \{ foo\_IntDoubleNothing, foo\_IntCharNothing, foo\_DoubleIntNothing \}$
 
    From this list of possible functions, a list of possible parameter types can be infered:
   - Parameter 1: ={Int, Double}=
   - Parameter 2: ={Double, Char, Int}=
 
   With these sets of parameter types, these can be applied to the parameter expressions =bar()= and =cello()=:
   - $\Theta \Lambda(\{Int, Double\}, \ast)[bar()] = \{ Int \}$
   - $\Theta \Lambda(\{Int, Double, Char\}, \ast)[cello()]] = \{ Int, Double \}$
 
   With these reduced sets of parameter types this can be then applied again to the =foo= function overloads to see if the number of possible overloads can be reduced:

   $\Omega (\{Nothing\}.[\{Int\}, \{Double, Int\}])[foo] = \{foo\_IntDoubleNothing\}$

   This finds the only possible function overload that =foo= can be refering to as =foo_IntDoubleNothing= allowing for the whole expression to be infered as:
   #+BEGIN_SRC c++
   foo_IntDoubleNothing(bar_Int(), cello_Double())
   #+END_SRC

   This can be considered horizontal inference as the type of =bar= has a direct effect on the type of =cello=. Had the possible function overloads for =bar= have been:
   #+BEGIN_SRC c++
   Double bar() {..}
   Char bar() {..}
   #+END_SRC
   Then the expression would have evaluated as:
   #+BEGIN_SRC c++
   foo_DoubleIntNothing(bar_Double(), cello_Int())
   #+END_SRC
