documents/FunctionInference.html
<li><a id="org60b8f49"></a>Applying the Function Inference Algorithm to Expression B<br />
<div class="outline-text-5" id="text-2-2-3-1">
<p>
As expression B is being used as a statement, the function inference begins with the known return type <code>Nothing</code> and unknown parameter types.
This gives the &lambda; function: 
</p>

<ul class="org-ul">
<li>\(\Lambda(\{Nothing\}.\ast)[foo(bar(),cello())]\)

<ul class="org-ul">
<li>\(p := [\forall (\alpha,\beta).\Theta \Lambda (\alpha, \ast) [\beta] | \textit{zip}(\Theta \Omega (\{Nothing\}.\ast)[foo], [bar(),cello()]])]\)
<ul class="org-ul">
<li>\(\Omega (\{Nothing\}.\ast)[foo] = \{ foo\_IntDoubleNothing, foo\_IntCharNothing, foo\_DoubleIntNothing \}\)</li>

<li>\(\Theta \{ foo\_IntDoubleNothing, foo\_IntCharNothing, foo\_DoubleIntNothing \} = [\{Int, Double\}, \{Int, Double, Char\}]\)</li>

<li>\(\textit{zip}([\{Int, Double\}, \{Int, Double, Char\}], [bar(), cello()]) = [(\{Int, Double\}, bar()), (\{Int, Double, Char\}, cello())\)</li>

<li>\(p = [\Theta \Lambda(\{Int, Double\}, \ast)[bar()], \Theta \Lambda(\{Int, Double, Char\}, \ast)[cello()]]\)

<ul class="org-ul">
<li>\(\Lambda(\{Int, Double\}, \ast)[bar()]\)

<ul class="org-ul">
<li>\(p := []\)</li>

<li><p>
\(\Omega (\{Int, Double\}, [])[bar] = \{bar\_Int\}\)
</p>

<p>
<b>RESOLVES</b>
</p></li>

<li>\(\Rightarrow \Lambda (\{Int, Double\}, \ast)[bar()] = \{bar\_Int\} = \{bar\_Int\}\)</li>
</ul></li>

<li>\(\Lambda(\{Int, Double, Char\}, \ast)[cello()]\)

<ul class="org-ul">
<li>\(p := []\)</li>

<li>\(\Lambda(\Phi \Omega (\{Int, Double, Char\}, [])[cello], [])[cello()]\)

<ul class="org-ul">
<li>\(\Omega (\{Int, Double, Char\}, [])[cello] = \{cello\_Int, cello\_Double\}\)</li>

<li>\(\Phi \{cello\_Int, cello\_Double\}\)</li>

<li>\(\Lambda(\{Int, Double\}, [])[cello()]\)

<ul class="org-ul">
<li>\(p := []\)</li>

<li><p>
\(\Omega(\{Int, Double\}, [])[cello] = \{cello\_Int, cello\_Double\}\)
</p>

<p>
<b>CYCLIC</b>
</p></li>

<li>\(\Rightarrow \Lambda(\{Int, Double\}, [])[cello()] = \{cello\_Int, cello\_Double\}\)</li>
</ul></li>
</ul></li>

<li>\(\Rightarrow \Lambda(\{Int, Double, Char\}, \ast)[cello()] = \{cello\_Int, cello\_Double\}\)</li>
</ul></li>

<li>\(p = [\Theta \{bar\_Int\}, \Theta \{cello\_Int, cello\_Double]\)</li>

<li>\(p = [\{Int\}, \{Int, Double\}]\)</li>
</ul></li>
</ul></li>

<li>\(\Lambda(\Phi \Omega(\{Nothing\}, [\{Int\}, \{Int, Double\}])[foo], [\{Int\}, \{Int, Double\}])[foo(bar(),cello())]\)

<ul class="org-ul">
<li>\(\Phi \Omega(\{Nothing\}, [\{Int\}, \{Int, Double\}])[foo] = \{Nothing\}\)</li>

<li>\(\Lambda(\{Nothing\}, [\{Int\}, \{Int, Double\}])[foo(bar(),cello())]\)

<ul class="org-ul">
<li><p>
\(\Omega(\{Nothing\}, [\{Int\}, \{Int, Double\}])[foo] = \{foo\_IntDoubleNothing\}\)
</p>

<p>
<b>RESOLVES</b>
</p></li>

<li>\(\Rightarrow \Lambda(\Phi \Omega(\{Nothing\}, [\{Int\}, \{Int, Double\}])[foo], [\{Int\}, \{Int, Double\}])[foo(bar(),cello())] = \{foo\_IntDoubleNothing\}\)</li>
</ul></li>
</ul></li>

<li>\(\Rightarrow \Lambda(\{Nothing\}, \ast)[foo(bar(),cello())] = \{foo\_IntDoubleNothing\}\)</li>
</ul></li>
</ul>
</div>


<ol class="org-ol">
<li><a id="org9954606"></a>Explaination<br />
<div class="outline-text-6" id="text-2-2-3-1-1">
<p>
As with before, each expression within expression <i>B</i> cannot on its own have it's function infered. 
Again as before, as the main expression <i>B</i> is being used as a statement,
the type can be infered to be <code>Nothing</code>. As such, the set of possible <code>foo</code> functions expression <i>B</i> could refer to is:
</p>

<p>
\(\Omega (\{Nothing\}.\ast)[foo] = \{ foo\_IntDoubleNothing, foo\_IntCharNothing, foo\_DoubleIntNothing \}\)
</p>

<p>
From this list of possible functions, a list of possible parameter types can be infered:
</p>
<ul class="org-ul">
<li>Parameter 1: <code>{Int, Double}</code></li>
<li>Parameter 2: <code>{Double, Char, Int}</code></li>
</ul>

<p>
With these sets of parameter types, these can be applied to the parameter expressions <code>bar()</code> and <code>cello()</code>:
</p>
<ul class="org-ul">
<li>\(\Theta \Lambda(\{Int, Double\}, \ast)[bar()] = \{ Int \}\)</li>
<li>\(\Theta \Lambda(\{Int, Double, Char\}, \ast)[cello()]] = \{ Int, Double \}\)</li>
</ul>

<p>
With these reduced sets of parameter types this can be then applied again to the <code>foo</code> function overloads to see if the number of possible overloads can be reduced:
</p>

<p>
\(\Omega (\{Nothing\}.[\{Int\}, \{Double, Int\}])[foo] = \{foo\_IntDoubleNothing\}\)
</p>

<p>
This finds the only possible function overload that <code>foo</code> can be refering to as <code>foo_IntDoubleNothing</code> allowing for the whole expression to be infered as:
</p>
<div class="org-src-container">
<pre class="src src-c++">foo_IntDoubleNothing(bar_Int(), cello_Double())
</pre>
</div>

<p>
This can be considered horizontal inference as the type of <code>bar</code> has a direct effect on the type of <code>cello</code>. Had the possible function overloads for <code>bar</code> have been:
</p>
<div class="org-src-container">
<pre class="src src-c++">Double bar() {..}
Char bar() {..}
</pre>
</div>
<p>
Then the expression would have evaluated as:
</p>
<div class="org-src-container">
<pre class="src src-c++">foo_DoubleIntNothing(bar_Double(), cello_Int())
</pre>
</div>
</div>
</li>
</ol>
</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Michael Lynch</p>
<p class="date">Created: 2019-03-10 Sun 18:15</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
